In [3]:
import numpy as np
import pandas as pd

In [3]:
labels=['a','b','c']
my_data=[1,2,3]
arr=np.array(my_data)
d={'a':10,'b':20,'c':30}

In [4]:
pd.Series(my_data,labels)

a    1
b    2
c    3
dtype: int64

In [4]:
labels

['a', 'b', 'c']

In [5]:
arr

array([1, 2, 3])

In [6]:
d

{'a': 10, 'b': 20, 'c': 30}

In [7]:
pd.Series(labels,my_data)

1    a
2    b
3    c
dtype: object

In [8]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [12]:
ser1 = pd.Series([1,2,3,4],index = ['USA', 'Germany','USSR', 'Japan'])

In [13]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [14]:
ser1['USSR']

3

In [5]:
from numpy.random import randn

In [6]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [7]:
df

          W         X         Y         Z
A -0.658385  0.985555  0.109110  0.531567
B -0.727256 -0.765246 -0.539250 -0.552648
C  0.703559  1.060538 -0.696135 -0.734385
D  0.040592  1.927802  0.200484 -0.083401
E -0.394026  1.439682  0.735974 -0.795927

  index         W         X         Y         Z
0     A  1.224690 -0.496247 -0.164019 -0.996758
1     B -0.103062 -0.411379 -1.428073  0.646825
2     C  0.012732  0.389018 -0.902506 -0.440266
3     D  1.214623  0.154149  0.590418  0.549136
4     E  2.248484 -0.659045  0.118820 -1.340783

In [18]:
type(df)

pandas.core.frame.DataFrame

In [19]:
type(df['W'])

pandas.core.series.Series

In [20]:
df.W

A    1.848492
B    0.140360
C   -0.726694
D    1.113836
E    1.090281
Name: W, dtype: float64

In [21]:
df[['W','Z']]

          W         Z
A  1.848492  0.316535
B  0.140360 -0.213013
C -0.726694 -0.943067
D  1.113836  1.433406
E  1.090281  1.090274

In [22]:
df

          W         X         Y         Z
A  1.848492 -0.610976  1.740784  0.316535
B  0.140360 -0.137447 -0.078718 -0.213013
C -0.726694  0.580500  0.235480 -0.943067
D  1.113836 -2.832891  1.212216  1.433406
E  1.090281  0.293757 -0.980610  1.090274

In [23]:
df['new']=df['Y']+df['Z']

In [24]:
df

          W         X         Y         Z       new
A  1.848492 -0.610976  1.740784  0.316535  2.057318
B  0.140360 -0.137447 -0.078718 -0.213013 -0.291731
C -0.726694  0.580500  0.235480 -0.943067 -0.707587
D  1.113836 -2.832891  1.212216  1.433406  2.645621
E  1.090281  0.293757 -0.980610  1.090274  0.109664

In [25]:
df.drop('new',axis=1)

          W         X         Y         Z
A  1.848492 -0.610976  1.740784  0.316535
B  0.140360 -0.137447 -0.078718 -0.213013
C -0.726694  0.580500  0.235480 -0.943067
D  1.113836 -2.832891  1.212216  1.433406
E  1.090281  0.293757 -0.980610  1.090274

In [26]:
df

          W         X         Y         Z       new
A  1.848492 -0.610976  1.740784  0.316535  2.057318
B  0.140360 -0.137447 -0.078718 -0.213013 -0.291731
C -0.726694  0.580500  0.235480 -0.943067 -0.707587
D  1.113836 -2.832891  1.212216  1.433406  2.645621
E  1.090281  0.293757 -0.980610  1.090274  0.109664

In [27]:
df.drop('new',axis=1,inplace=True)

In [28]:
df

          W         X         Y         Z
A  1.848492 -0.610976  1.740784  0.316535
B  0.140360 -0.137447 -0.078718 -0.213013
C -0.726694  0.580500  0.235480 -0.943067
D  1.113836 -2.832891  1.212216  1.433406
E  1.090281  0.293757 -0.980610  1.090274

In [29]:
df.drop('E',axis=0)

          W         X         Y         Z
A  1.848492 -0.610976  1.740784  0.316535
B  0.140360 -0.137447 -0.078718 -0.213013
C -0.726694  0.580500  0.235480 -0.943067
D  1.113836 -2.832891  1.212216  1.433406

In [31]:
df.loc['A']

W    1.848492
X   -0.610976
Y    1.740784
Z    0.316535
Name: A, dtype: float64

In [32]:
type(df['W'])

pandas.core.series.Series

In [33]:
df.loc['B','X']

-0.13744654289129746

In [34]:
df[df>0]

          W         X         Y         Z
A  1.848492       NaN  1.740784  0.316535
B  0.140360       NaN       NaN       NaN
C       NaN  0.580500  0.235480       NaN
D  1.113836       NaN  1.212216  1.433406
E  1.090281  0.293757       NaN  1.090274

In [36]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [37]:
df[df['W']>0]

          W         X         Y         Z
A  1.848492 -0.610976  1.740784  0.316535
B  0.140360 -0.137447 -0.078718 -0.213013
D  1.113836 -2.832891  1.212216  1.433406
E  1.090281  0.293757 -0.980610  1.090274

In [38]:
df['Z']<0

A    False
B     True
C     True
D    False
E    False
Name: Z, dtype: bool

In [39]:
df[df['W']>0][['X','Y']]

          X         Y
A -0.610976  1.740784
B -0.137447 -0.078718
D -2.832891  1.212216
E  0.293757 -0.980610

In [41]:
bools=df['W']>0

In [43]:
result=df[bools]

In [45]:
cols=['Y','X']

In [46]:
result[cols]

          Y         X
A  1.740784 -0.610976
B -0.078718 -0.137447
D  1.212216 -2.832891
E -0.980610  0.293757

In [50]:
df[(df['W']>0) & (df['Y'])>1]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [51]:
df

          W         X         Y         Z
A  1.848492 -0.610976  1.740784  0.316535
B  0.140360 -0.137447 -0.078718 -0.213013
C -0.726694  0.580500  0.235480 -0.943067
D  1.113836 -2.832891  1.212216  1.433406
E  1.090281  0.293757 -0.980610  1.090274

In [52]:
newind='IND USA AUS JAP ENG'.split()

In [53]:
df['Countries']=newind

In [54]:
df

          W         X         Y         Z Countries
A  1.848492 -0.610976  1.740784  0.316535       IND
B  0.140360 -0.137447 -0.078718 -0.213013       USA
C -0.726694  0.580500  0.235480 -0.943067       AUS
D  1.113836 -2.832891  1.212216  1.433406       JAP
E  1.090281  0.293757 -0.980610  1.090274       ENG

In [58]:
#not permanent until inplace=True is used
df.set_index("Countries")

                  W         X         Y         Z
Countries
IND        1.848492 -0.610976  1.740784  0.316535
USA        0.140360 -0.137447 -0.078718 -0.213013
AUS       -0.726694  0.580500  0.235480 -0.943067
JAP        1.113836 -2.832891  1.212216  1.433406
ENG        1.090281  0.293757 -0.980610  1.090274

In [59]:
df

          W         X         Y         Z Countries
A  1.848492 -0.610976  1.740784  0.316535       IND
B  0.140360 -0.137447 -0.078718 -0.213013       USA
C -0.726694  0.580500  0.235480 -0.943067       AUS
D  1.113836 -2.832891  1.212216  1.433406       JAP
E  1.090281  0.293757 -0.980610  1.090274       ENG

In [11]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [66]:
df=pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [67]:
df

             A         B
G1 1 -1.205392  0.608586
   2 -0.399847  0.242084
   3  0.798296  0.791519
G2 1  0.560093 -0.507326
   2  0.482482  0.351444
   3  0.801984 -1.314710

In [68]:
df.loc['G1'].loc[1]

A   -1.205392
B    0.608586
Name: 1, dtype: float64

In [70]:
df.index.names

FrozenList([None, None])

In [71]:
df.index.names=['Groups','Num']

In [72]:
df

                   A         B
Groups Num
G1     1   -1.205392  0.608586
       2   -0.399847  0.242084
       3    0.798296  0.791519
G2     1    0.560093 -0.507326
       2    0.482482  0.351444
       3    0.801984 -1.314710

In [77]:
df.loc['G1'].loc[2].loc['B']

0.24208357619519896

In [78]:
df.xs(1,level='Num')

               A         B
Groups
G1     -1.205392  0.608586
G2      0.560093 -0.507326

In [15]:
d={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [16]:
df=pd.DataFrame(d)

In [17]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [18]:
df.dropna(axis=0)

     A    B  C
0  1.0  5.0  1

In [19]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [20]:
df.fillna(value='Fill')

      A     B  C
0     1     5  1
1     2  Fill  2
2  Fill  Fill  3

In [27]:
df['B'].fillna(value=df['B'].mean())

0    5.0
1    5.0
2    5.0
Name: B, dtype: float64

In [29]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [30]:
df=pd.DataFrame(data)

In [31]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [32]:
bycomp=df.groupby('Company')

In [35]:
bycomp

In [94]:
#single statement code

df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [97]:
#NUMBER OF PEOPLE IN GOOG

df.groupby('Company').count().loc['GOOG'].loc['Person']

2

In [98]:
#Important funtion

df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [104]:
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

In [105]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [106]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [107]:
df2=pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [108]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [109]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [110]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [111]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [112]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [113]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [115]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [116]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [121]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [122]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [36]:
pd.merge(left,right,how='inner',on=['key1','key2'])

NameError: name 'left' is not defined

In [128]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [131]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [132]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [133]:
df['col2'].nunique()

3

In [134]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [136]:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [138]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [139]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [37]:
df.columns

Index(['Company', 'Person', 'Sales'], dtype='object')